# running in axi_vhdl/src/
plugin -i ghdl
ghdl --std=08 axi4lite_slave_adapter.vhd bus_matrix_core.vhd bus_matrix_regs.vhd bus_matrix_axi.vhd -e bus_matrix_axi
read -formal bus_matrix_props.sv
read -formal bus_matrix_binds.sv
read -formal -D BUS_AXI bus_matrix_axi_vhdl_binds.sv
prep -top bus_matrix_axi

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
