# running in apb/src/
read -formal timer_props.sv
read -formal timer_regs.sv
read -formal timer_core.sv
read -formal apb_slave_adapter.sv
read -formal timer_apb.sv
read -formal timer_binds.sv
prep -top timer_apb

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
