# running in axi/src/
read -formal timer_props.sv
read -formal timer_regs.sv
read -formal timer_core.sv
read -formal timer_axi.sv
read -formal timer_binds.sv
prep -top timer_axi

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
