# running in apb_vhdl/src/
plugin -i ghdl
ghdl --std=08 apb_slave_adapter.vhd bus_matrix_core.vhd bus_matrix_regs.vhd bus_matrix_apb.vhd -e bus_matrix_apb
read -formal bus_matrix_props.sv
read -formal bus_matrix_binds.sv
read -formal -D BUS_APB bus_matrix_apb_vhdl_binds.sv
prep -top bus_matrix_apb

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
