# running in wb_vhdl/src/
plugin -i ghdl
ghdl --std=08 wb_slave_adapter.vhd bus_matrix_core.vhd bus_matrix_regs.vhd bus_matrix_wb.vhd -e bus_matrix_wb
read -formal bus_matrix_props.sv
read -formal bus_matrix_binds.sv
read -formal -D BUS_WB bus_matrix_wb_vhdl_binds.sv
prep -top bus_matrix_wb

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
