# running in wb/src/
read -formal gpio_props.sv
read -formal gpio_regs.sv
read -formal gpio_wrapper.sv
read -formal gpio_bit.sv
read -formal wb_slave_adapter.sv
read -formal gpio_wb.sv
read -formal gpio_binds.sv
prep -top gpio_wb

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
