# running in axi/src/
read_verilog -sv -formal bus_matrix_pkg.sv
read_verilog -sv -formal bus_matrix_decoder.sv
read_verilog -sv -formal bus_matrix_arbiter.sv
read_verilog -sv -formal bus_matrix_register_slice.sv
read_verilog -sv -formal bus_matrix_axi.sv
read_verilog -sv -formal bus_matrix_props.sv
read_verilog -sv -formal bus_matrix_binds.sv
prep -top bus_matrix_axi

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
